def front_banner():
	#banner="""
	#		코리아 IT 현금 인출기 입니다. !!! 
	#		"""
	banner="""
			

			
			코리아 IT 현금 인출기 입니다.!!!
			
			
			>>> 아무키나 입력해주세요!! <<<
			
			

    """
	print(banner)		
	#return banner
	#print(banner)

def ending_banner():
	#banner="""
	#		코리아 IT 현금 인출기 입니다. !!! 
	#		"""
	banner="""
			

			
			코리아 IT 현금 인출기 입니다.!!!
			
			
			>>> 프로그램을 종료 합니다. !!! <<<
			
			

    """
	print(banner)	


def passwd_banner():
	print("###############################################")
	print("###############################################")
	print("##                                           ##")
	print("##      사용자 인증이 필요한 메뉴 입니다!!!         ##")
	print("##                                           ##")
	print("###############################################")
	print("###############################################")