#while을 이용해서 누적합을 구해보세요. 
import time 
import datetime 

#1 ~ 10 까지의 합을 구하세요.

# 짝수만 합을 구하기   

###  
i=0  ## 파이션에서 변수 자료 저장간. 초기화, 
     ## 파이션 컴파일러 엔진 초기화는 수행함.
	 ## 컴파일러- 번역기  영어를 한국 바꾸어주는
	 ## 텍스트잖아 문자열 => 기계어 변경 해주는것을 컴파일러
	 ## 인터프린터 언어 => 기계어 python 엔진, 
	 ## 
	 ## while => mov exp, eip, => 0101010101
	 ## 인터프린터  #=> mov exp, eip, => 0101010101 , debug 버그 
	 ## pep , 
	 ## True        
	 ## log 기계어 ( 기계어 래벨 ) => 인터프린터  
	 ## ## 코딩 라인이 많아지면 관리가 힘들어.
	 ## python c,  java. cpython, jpython ,  c, java 같이 쓸수 이싿.
	 
	 ## dll 파일도 import 해서 쓸수 있다. 
	 ## 데이터 가공 처리는 파이션수행
	 ## 속도를 요구하는 것은 C언어로 하고. 
	 ## 
	 ## dos,  while 키보드 입력 , threading 이용 
	 ## 10분 ~  5시 15분까지 휴식 
	 
i=0
total=0 
while True:	

	### 특정 시간에 특정 수행한다. 
	### 시간을 체크  ##   ### 
	### r=requests.get("www.naver.com", au...)
	### while 반복문 특정 에 특정 반복 하게 할수 있게 
	### 무한돌리면서 09:00 www.naver.com 체크 ..
	### 보안점검 체크 자동  08:30   자동으로  
	### while  
	### 특정 시간에 메일 보내기 
	### 
	### 08:30 프로그래밍이 구동 되서 15:30 에 종료 / 내가 메일 같은 시간에 구동 시켜야되 
	### 금융 데이터 갱신 시간에 맞추어가 가져오기
	### 구글독 09시에 차장 님 메일 구글독(회사 중요사이트 구글에 노출여부) 수행 결과를 자동발송 
	### 구글 악성 등록 한달, 
	### 문서도 로그를 체크해서 문서도 자동으로 생성   ## 자동   <== 
	### 메일 자동 메일 발송                                     <== 
	###  while thread  <== 
	
	i=i+1
	total+=i

	#로그 분석   
			
	#print(total)
	
	#print(i)
	if( i>=10):
		break
	print(i)

#빠져나오는 조건이 없어서.
print(total)
	

D:\workspace\py_5m\pybasic5\02>
c:\workspace\py_5m\pybasic5\02>	

