###############################
with open("foo.txt","r") as f:
    f.write("Lift is too short, you need python")
    f.close() ## 자동으로 해준다. 
####

f=open('test.txt','a'):
## 함수로 만들기 
# 파일생성, # 파일데이터를 쓰고 # 파일을 읽는 함수를 만드세요.!!! 

## 현금인출기 프로그램에서 인출금액에 대해서 테스트 파일로 
## 저장장 기록해보세요.  
## 현금인출기에서 현금을 인출한 결과를 파일로 기록하세요.
## 시스템 로그  
## 추적 => 책임추적성 => 시스템 항상요구 =?
## 책임추적성은 기본적인 보안요구사항중에 하나 
## 여려분이 만든 현금인출기는 로깅을 수행하는지 


## 5시 10분까지  쉬면서 진행해 보세요. 
## 계속 ,
## 기계 10만원 인출 로그에 5만원 ... 확인해야ㅣ..
## 기록해서 비교 ? 
## 해보세요. 
## ##### 
