#################################
# 파일명 : if02.py 
# 작성일자 : 2017. 5. 29
# 설명: if문 기초 예제입니다. 
# 비교연산자를 설명합니다. 
################################
money=1
if money:
	print("택시를")
	print("타고")
else:
	print("가자")

## 조건문 다음에 콜론(:)을 잊지 말자!!!
## for, def, class, while문의 끝에는  (:)을 항상 붙인다.
print("비교연산자 실습")	
print("="*70)
print( " 조건의 결과가 거짓일때 ")
print("3>5",3>5)
print( " 조건의 결과가 참일 일때 ")
print("5>3",5>3)
print("5==3",5==3)
print("5!=3",5!=3)

print("프로그램에서는 참(True)일때 1 , 거짓(False)일때 0 이라고 합니다. ")
print("="*70)	

## 조건문 다음에 콜론(:)을 잊지 말자!!!
## for, def, class, while문의 끝에는  (:)을 항상 붙인다.