'''
Author: SeongHun Kang
Date : 2017. 05. 20
이프로그램은 Hello World를 출력하는 프로그램이다. 
'''




#수업 참고 교재 
#점프투 파이션 

# 파이션 프로그래밍 일정
# 01일차 
# OT 
# 1. 파이션은 무엇인가 ?
# 1.1. 컴퓨터 아키텍처
# 1.2. 메모리 구조 
# 2. 자료형
# 2.1 숫자형
# 2.2 문자열 자료형
# 2.3 리스트 자료형 
# 2.3 튜플자료형 ( 간한한 소개 )
# 2.4 집합자료형 
# 2.5 딕셔너리 자료형 
# 2.6 집합자료형
# 2.7 자료형 참 과 것
# 2.8 자료형의 값을 저장하는 공간, 변수 

# Quiz 연습문제
# 03 흐름제어 
# 03-1 if 
# 03-2 while 
# 03-3 for
# 03-4 알고리즘
# Quiz 연습문제

# 04 
# 04-01 함수
# 04-02 입력과 출력
# 04-03 파일 읽고 쓰기
# Quiz 연습문제
# 05
# 05-1 클래스  
# 05-2 모듈
# 05-3 패키지
# 05-4 GUI 프로그램 ( Sample1 )
# 05-5 GUI 프로그램 ( Sample2 )
# 05-6 예외처리
# 05-7 내장함수
# 05-8 외장함수
# 05 Quiz 연습문제
# 06 파이션프로그램 어떻게 시작할까
# 06 Quiz 연습문제
# 07-01 정규표현식1
# 07-02 정규표현식2
# 07-03 정규표현식3 
# 07-04 XML 처리
# 07-05 CSV 처리 
# 07-06 docx 리포트 생성
# Quiz 연습문제 
# git 사용법 소개  
# Socket 통신 
# Socket 통신 사용하는 이유 (이론 )
# 백신 개발하기 (Sample )
# 프로그램 배포 하기 (nsis) => 간간한 설치 프로그램 만들기 
# 파이션 실행파일로 만들기 
# python exploit 
# 웹 크롤링
# 쓰레드 (thread, threading)
# 로깅
# 알고리즘  




#python 동작 테스트 
#설치 및 특징 / 환경구성 

'''
파이션의 특징 
 1) 인간다운 언어 이다. 
	if 4 in [1,2,3,4]: print("4가 있습니다.")
 2)문법이 쉬워 빠르게 배울 수 있다.
 3) 파이션은 무료이지만 강력하다.
 4) 파이션은 간결하다.
 5) 파이션은 프로그래밍을 즐기게 해준다.
 6) 파이션은 패키지들을 사용하여 개발 속도가 빠르다. 
 
 
'''

'''	
파이션으로 무엇을 할수 있을까?
1. 시스템 유틸리티 제작
2. GUI 프로그램 개발
3. C/C++ 와의 결합
4. 웹프로그래밍
5. 수치 연산 프로그램
6. 데이터 베이스 프로그래밍을
7. 데이터 분석, 사물 인터넷
8. 웹 exploit 개발 및 시연


피이션으로 할수 없는 일
1. 시스템 과 밀접한 프로그래밍 영역
2. 모바일 프로그래밍 
'''

# 다운로드 URL : https://www.python.org/downloads/

if 4 in [1,2,3,4]: print('4가 있습니다.')

#기초 실습 준비 


print("안녕하세요.!!! 여러분과 파이션 수업을 진행할 강성훈입니다.!!! ")
print(" 방갑습니다. !! ")

import sys
print(sys.exit())
print(sys.version)
	
#python 기본

