#수업 참고 교재
#점프투 파이션
파이션 프로그래밍 일정
01일차
OT
#1. 파이션은 무엇인가 ?
##1.1. 컴퓨터 아키텍처
##1.2. 메모리 구조
#2. 자료형
##2.1 숫자형
##2.2 문자열 자료형
##2.3 리스트 자료형
##2.3 튜플자료형 ( 간한한 소개 )
##2.4 집합자료형
##2.5 딕셔너리 자료형
##2.6 집합자료형
##2.7 자료형 참 과 것
##2.8 자료형의 값을 저장하는 공간, 변수
##Quiz 연습문제
#03 흐름제어
##03-1 if
##03-2 while
##03-3 for
##03-4 알고리즘
##Quiz 연습문제
#04 함수와 입출력
##04-01 함수
##04-02 입력과 출력
##04-03 파일 읽고 쓰기
##Quiz 연습문제
#05  클래스 
##05-1 클래스
##05-2 모듈
##05-3 패키지
##05-4 GUI 프로그램 ( Sample1 )
##05-5 GUI 프로그램 ( Sample2 )
##05-6 예외처리
##05-7 내장함수
##05-8 외장함수
##05 Quiz 연습문제
#06-01 파이션프로그램 어떻게 시작할까
##06 Quiz 연습문제
#07 정규표현식
##07-01 정규표현식1
##07-02 정규표현식2
##07-03 정규표현식3
#08 데이터 다루기
##08-01 XML 처리
##08-02 CSV 처리
##08-03 docx 리포트 생성
##Quiz 연습문제

# 응용 및 번외 
##git 사용법 소개
##Socket 통신
##Socket 통신 사용하는 이유 (이론 )
##백신 개발하기 (Sample )
##프로그램 배포 하기 (nsis) => 간간한 설치 프로그램 만들기
##파이션 실행파일로 만들기
##python exploit
##웹 크롤링
##쓰레드 (thread, threading)
##로깅
##알고리즘